### [그룹화 처리]
- 주제 : 타이타닉에서 선실에 등급에 따른 생존 비율을 분석

In [189]:
# [1] 모듈로딩
import pandas as pd
import df_util as util

In [190]:
# [2] 데이터 준비
file_name = 'titanic.csv'

In [191]:
# [3] csv ==> DataFrame으로 저장
dataDF=pd.read_csv(file_name)

In [192]:
# [4] 데이터 확인
util.checkDataFrame(dataDF, 'dataDF')

[dataDF]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB
[Index] : RangeIndex(start=0, stop=891, step=1)
[Columns] : Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')
[NDim] : 2

In [193]:
# [5] 분석 주제 ==> 선실에 등급에 따른 생존 비율을 분석
# - 분석 컬럼 즉, 선실과 생존 컬럼
# - loc[행,열]
pc_aliveDF=dataDF.loc[:,['sex','age']]            # OR dataDF[['sex','age']]

In [194]:
pc_aliveDF

        sex   age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

In [195]:
# [5-1] 데이터 전처리 : 결측치, 중복값
# --- 결측치 : isna(), isnull()
pc_aliveDF.isna().sum()         # False => 정상데이터

sex      0
age    177
dtype: int64

In [196]:
groupObject=pc_aliveDF.groupby('sex') 
groupObject

In [197]:
# -- Group 객체의 속성
# -- Groups 속성 : 그룹화된 그룹에 속하는 인덱스 정보 저장 Dict 형태
print( groupObject.groups.keys() )
print( groupObject.groups.values())

dict_keys(['female', 'male'])
dict_values([Index([  1,   2,   3,   8,   9,  10,  11,  14,  15,  18,
       ...
       866, 871, 874, 875, 879, 880, 882, 885, 887, 888],
      dtype='int64', length=314), Index([  0,   4,   5,   6,   7,  12,  13,  16,  17,  20,
       ...
       873, 876, 877, 878, 881, 883, 884, 886, 889, 890],
      dtype='int64', length=577)])

In [198]:
print(groupObject.indices)
print( groupObject.indices.keys() )

{'female': array([  1,   2,   3,   8,   9,  10,  11,  14,  15,  18,  19,  22,  24,
        25,  28,  31,  32,  38,  39,  40,  41,  43,  44,  47,  49,  52,
        53,  56,  58,  61,  66,  68,  71,  79,  82,  84,  85,  88,  98,
       100, 106, 109, 111, 113, 114, 119, 123, 128, 132, 133, 136, 140,
       141, 142, 147, 151, 156, 161, 166, 167, 172, 177, 180, 184, 186,
       190, 192, 194, 195, 198, 199, 205, 208, 211, 215, 216, 218, 229,
       230, 233, 235, 237, 240, 241, 246, 247, 251, 254, 255, 256, 257,
       258, 259, 264, 268, 269, 272, 274, 275, 276, 279, 289, 290, 291,
       293, 297, 299, 300, 303, 306, 307, 309, 310, 311, 312, 315, 316,
       318, 319, 322, 323, 325, 327, 328, 329, 330, 334, 337, 341, 345,
       346, 347, 356, 357, 358, 359, 362, 366, 367, 368, 369, 374, 375,
       376, 380, 381, 383, 387, 389, 393, 394, 396, 399, 402, 404, 409,
       412, 415, 416, 417, 419, 423, 426, 427, 431, 432, 435, 436, 437,
       440, 443, 446, 448, 457, 458, 469, 472, 473, 474, 479, 483, 485,
       486, 496, 498, 501, 502, 503, 504, 506, 513, 516, 518, 520, 523,
       526, 530, 533, 534, 535, 537, 539, 540, 541, 542, 546, 554, 556,
       558, 559, 564, 567, 571, 573, 576, 577, 578, 580, 581, 585, 591,
       593, 596, 600, 608, 609, 610, 612, 615, 617, 618, 627, 634, 635,
       638, 641, 642, 644, 649, 651, 653, 654, 657, 669, 670, 677, 678,
       680, 689, 691, 697, 700, 702, 706, 708, 710, 716, 717, 720, 726,
       727, 729, 730, 736, 742, 747, 750, 754, 759, 763, 765, 767, 772,
       774, 777, 779, 780, 781, 786, 792, 796, 797, 799, 801, 807, 809,
       813, 816, 820, 823, 829, 830, 835, 842, 849, 852, 853, 854, 855,
       856, 858, 862, 863, 865, 866, 871, 874, 875, 879, 880, 882, 885,
       887, 888], dtype=int64), 'male': array([  0,   4,   5,   6,   7,  12,  13,  16,  17,  20,  21,  23,  26,
        27,  29,  30,  33,  34,  35,  36,  37,  42,  45,  46,  48,  50,
        51,  54,  55,  57,  59,  60,  62,  63,  64,  65,  67,  69,  70,
        72,  73,  74,  75,  76,  77,  78,  80,  81,  83,  86,  87,  89,
        90,  91,  92,  93,  94,  95,  96,  97,  99, 101, 102, 103, 104,
       105, 107, 108, 110, 112, 115, 116, 117, 118, 120, 121, 122, 124,
       125, 126, 127, 129, 130, 131, 134, 135, 137, 138, 139, 143, 144,
       145, 146, 148, 149, 150, 152, 153, 154, 155, 157, 158, 159, 160,
       162, 163, 164, 165, 168, 169, 170, 171, 173, 174, 175, 176, 178,
       179, 181, 182, 183, 185, 187, 188, 189, 191, 193, 196, 197, 200,
       201, 202, 203, 204, 206, 207, 209, 210, 212, 213, 214, 217, 219,
       220, 221, 222, 223, 224, 225, 226, 227, 228, 231, 232, 234, 236,
       238, 239, 242, 243, 244, 245, 248, 249, 250, 252, 253, 260, 261,
       262, 263, 265, 266, 267, 270, 271, 273, 277, 278, 280, 281, 282,
       283, 284, 285, 286, 287, 288, 292, 294, 295, 296, 298, 301, 302,
       304, 305, 308, 313, 314, 317, 320, 321, 324, 326, 331, 332, 333,
       335, 336, 338, 339, 340, 342, 343, 344, 348, 349, 350, 351, 352,
       353, 354, 355, 360, 361, 363, 364, 365, 370, 371, 372, 373, 377,
       378, 379, 382, 384, 385, 386, 388, 390, 391, 392, 395, 397, 398,
       400, 401, 403, 405, 406, 407, 408, 410, 411, 413, 414, 418, 420,
       421, 422, 424, 425, 428, 429, 430, 433, 434, 438, 439, 441, 442,
       444, 445, 447, 449, 450, 451, 452, 453, 454, 455, 456, 459, 460,
       461, 462, 463, 464, 465, 466, 467, 468, 470, 471, 475, 476, 477,
       478, 480, 481, 482, 484, 487, 488, 489, 490, 491, 492, 493, 494,
       495, 497, 499, 500, 505, 507, 508, 509, 510, 511, 512, 514, 515,
       517, 519, 521, 522, 524, 525, 527, 528, 529, 531, 532, 536, 538,
       543, 544, 545, 547, 548, 549, 550, 551, 552, 553, 555, 557, 560,
       561, 562, 563, 565, 566, 568, 569, 570, 572, 574, 575, 579, 582,
       583, 584, 586, 587, 588, 589, 590, 592, 594, 595, 597, 598, 599,
       601, 602, 603, 604, 605, 606, 607, 611, 613, 614, 616, 619, 620,
       621, 622, 623, 624, 625, 626, 628, 629, 630, 631, 632, 633, 636,
       637, 639, 640, 643, 645, 646, 647, 648, 650, 652, 655, 656, 658,
       659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 671, 672, 673,
       674, 675, 676, 679, 681, 682, 683, 684, 685, 686, 687, 688, 690,
       692, 693, 694, 695, 696, 698, 699, 701, 703, 704, 705, 707, 709,
       711, 712, 713, 714, 715, 718, 719, 721, 722, 723, 724, 725, 728,
       731, 732, 733, 734, 735, 737, 738, 739, 740, 741, 743, 744, 745,
       746, 748, 749, 751, 752, 753, 755, 756, 757, 758, 760, 761, 762,
       764, 766, 768, 769, 770, 771, 773, 775, 776, 778, 782, 783, 784,
       785, 787, 788, 789, 790, 791, 793, 794, 795, 798, 800, 802, 803,
       804, 805, 806, 808, 810, 811, 812, 814, 815, 817, 818, 819, 821,
       822, 824, 825, 826, 827, 828, 831, 832, 833, 834, 836, 837, 838,
       839, 840, 841, 843, 844, 845, 846, 847, 848, 850, 851, 857, 859,
       860, 861, 864, 867, 868, 869, 870, 872, 873, 876, 877, 878, 881,
       883, 884, 886, 889, 890], dtype=int64)}
dict_keys(['female', 'male'])

In [199]:
# -- get_group() : 그룹화된 그룹들 중에서 특정 그룹 데이터 읽기 DataFrame 반환
for key in groupObject.groups.keys():
    print(f'\n[{key}]')
    print(groupObject.get_group(key).ndim,groupObject.get_group(key).shape)
    print(groupObject.get_group(key).min(),groupObject.get_group(key).max())

[female]
2 (314, 2)
sex    female
age      0.75
dtype: object sex    female
age      63.0
dtype: object

[male]
2 (577, 2)
sex    male
age    0.42
dtype: object sex    male
age    80.0
dtype: object

In [200]:
# resultDF=groupObject.agg(['min','max','mean','median','sum'])
# resultDF

In [201]:
dataDF.survived.count() - dataDF.survived.sum()

549

In [202]:
~dataDF.survived.astype('bool')

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: survived, Length: 891, dtype: bool

- 사용자 정의 함수 지정하기

In [203]:
def myfunc(obj):
    print(type(obj),obj.head(3))
    return obj.max()

In [204]:
myfunc(dataDF['age'])

<class 'pandas.core.series.Series'> 0    22.0
1    38.0
2    26.0
Name: age, dtype: float64

80.0

In [205]:
groupObject.agg(['count',myfunc])

<class 'pandas.core.series.Series'> 1    38.0
2    26.0
3    35.0
Name: age, dtype: float64
<class 'pandas.core.series.Series'> 0    22.0
4    35.0
5     NaN
Name: age, dtype: float64

         age
       count myfunc
sex
female   261   63.0
male     453   80.0

In [206]:
groupObject.agg(['count',myfunc,lambda x:x.mean()])

<class 'pandas.core.series.Series'> 1    38.0
2    26.0
3    35.0
Name: age, dtype: float64
<class 'pandas.core.series.Series'> 0    22.0
4    35.0
5     NaN
Name: age, dtype: float64

         age
       count myfunc <lambda_0>
sex
female   261   63.0  27.915709
male     453   80.0  30.726645